<?php
@session_start();
include "connect_db.php";
ob_start();
require_once('mpdf/mpdf.php');
?>

<table width="100%" border="0" align="center" cellspacing="0">
    <tr>
      <td colspan="2" style="text-align: center;"><br><h3>สัญญาค้ำประกันเงินกู้เพื่อพัฒนาคุณภาพชีวิต</h3></td><br><br>
    </tr>
    <tr>
          <td colspan="2" style="text-align: right;">
              เขียนที่ <b>.................................. </b><br><br>
              วันที่   <b>..................................<br><br><br>
        </td>
    </tr>
    <tr>
        <td colspan="2" style="text-align: left;"><br>
        &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&emsp;ข้าพเจ้า.................................................................................
        ผู้กู้เงินตามสัญญาเงินกู้เพื่อพัฒนาคุณภาพชีวิต <br><br>
        สมาชิกแห่ง สถาบันการเงินชุมชนเทศบาลเมืองยโยธร หมายเลขทะเบียนสมาชิก................................................
        </td>  
    </tr>
        <tr>
        <td colspan="2" style="text-align: left;"><br>
            บัตรประจำตัวประชาชนเลขที่...............................................ที่อยุ่ปัจจุบันบ้านเลขที่............................ <br><br>
            ถนน.......................ตำบท.......................................อำเภอ.............................จังหวัด..................................<br><br>
            หมายเลขโทรศีพท์.......................................
        </td>  
    </tr>
        <tr>
            <td colspan="2" style="text-align: left;"><br>
            ขอทำหนังสือสัญญาเงินกู้เพื่อพัฒนาคุณภาพชีวิตให้ไว้ต่อ สถาบันการเงินชุมชนเทศบาลเมืองยโยธรซึ่งต่อไปนี้ในหนังสือ<br><br>
            สัญญาเงินกู้นี้จะใช้คำว่า สถาบันการเงิน เพื่อเป็นหลักฐานดังต่อไปนี้<br><br>
           &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
           ข้อ ๑. ข้าพเจ้าได้กู้เงินจากสถาบันการเงินเป็นจำนวน................บาท(..............................)<br><br>
        </td>  
    </tr>
           <tr>
        <td colspan="2" style="text-align: left;"><br>
           &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
           ข้อ ๒. ข้าพเจ้าสัญญาว่าจะส่งคืนเงินกู้เป็นวงดรายเดือน งวดละ (ตัวอักษร).........................บาท<br><br>
           พร้อมด้วยดอกเบี้ยในอัตราร้อยละ ตัวอักษร).....................ต่อปี รวม ตัวอักษร).....................................งวด
        </td>  
    </tr>
              <tr>
        <td colspan="2" style="text-align: left;"><br>
            เว้นแต่งวดสุดท้ายเป็นจำนวนเงิน (ตัวอักษร)..............................................................บาท ทั้งนี้ตั้งแต่งวด<br><br>
           ประจำเดือน.................................เป็นต้นไป
        </td>  
    </tr>
             <tr>
                 <td colspan="1" style="text-align: left;"><br>
        &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
        ข้าพเจ้าขอยืนยันว่า เงินงวดชำระหนี้เงินกู้เพื่อพัฒนาคุณภาพชีวิต(รวมทั้งต้นเงินและดอกเบี้ย)แต่ละงวดถึงกำหนด<br><br>
        ภายในวันสิ้นเดือนที่ระบุไว้สำหรับงวดนั้นๆ<br>
          </td>  
    </tr>
     <tr>
                 <td colspan="1" style="text-align: left;"><br>
       &nbsp;&nbsp;&nbsp;&emsp;
      ในกรณีที่สถาบันการเงิน ได้ประกาศเปลี่ยนแปลงอัตราดอกเบี้ยเงินกู้เพื่อพัฒนาคุณภาพชีวิตเพิ่มขึ้น  ผู้กู้ยินยอมเสีย<br><br>
ดอกเบี้ยเงินกู้เพื่อพัฒนาคุณภาพชีวิต ตามที่สถาบันการเงินเรียกเก็บเพิ่มขึ้น  เมื่อสถาบันการเงินได้แจ้งเป็นหนังสือให้ทราบ<br><br>
ล่วงหน้าไม่น้อยกว่า ๓๐ วัน หรือแจ้งทางจดหมายให้ทราบล่วงหน้าไม่น้อยกว่า ๗ วัน<br><br>
      </td>  
    </tr>
       <tr>
                 <td colspan="1" style="text-align: left;"><br>
         &nbsp;&nbsp;&nbsp;&emsp;
        ในกรณีที่แจ้งให้ทราบทางจดหมายนั้น ผู้กู้ยินยอมให้ถือว่า การแจ้งโดยการพิมพ์ข้อความการเรียกเก็บดอกเบี้ยเงินกู้<br><br>
เพื่อพัฒนาคุณภาพชีวิตเพิ่มขึ้นไว้ในใบเสร็จรับเงิน หรือเอกสารยื่นใดที่สถาบันการเงินจะต้องส่งให้แก่ผู้กู้เป็นประจำ เป็นการ<br><br>
แจ้งให้ทราบทางจดหมายแล้ว<br>
    </td>  
    </tr>
           <tr>
                 <td colspan="1" style="text-align: left;"><br>
  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
       ข้อ ๓. ข้าพเจ้ายินยอมให้ผู้บังคับบัญชา หรือเจ้าหน้าที่ผู้จ่ายเงินได้รายเดือนของข้าพเจ้า  เมื่อได้รับมอบหมายจาก<br><br>
สถาบันการเงินหักจำนวนเงินงวดชำระหนี้ซึ่งข้าพเจ้าต้องส่งต่อสถาบันการเงินนั้น จากเงินได้รายเดือนของข้าพเจ้า เพื่อส่งต่อ<br><br>
สถาบันการเงินด้วยความยินยอมนี้ให้มีอยู่ตลอดไป ทั้งนี้จนกว่าจะได้ชำระหนี้ตามสัญญานี้โดยสิ้นเชิงแล้ว<br><br>
</td>  
    </tr>
           <tr>
                 <td colspan="1" style="text-align: left;"><br>
  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
       ข้อ ๔. ข้าพเจ้ายินยอมถือว่า ไม่ว่าในกรณีใดๆ ซึ่งได้กำหนดไว้ในข้อบังคับของสถาบันการเงินว่าด้วนการควบคุม<br><br>
หลักประกัน และการเรียกคืนเงินกู้ให้ถือว่าเงินกู้นี้เป็นอันถึงกำหนดส่งคืนโดยสิ้นเชิง พร้อมทั้งดอกเบี้ยในทันที โดยมีหัก<br><br>
คำนึงถึงกำหนดเวลาที่ให้ไว้
                   
        </td>  
    </tr>
	</table>

<?Php
$html = ob_get_contents();
ob_end_clean();
$pdf = new mPDF('th', 'A4', '10', 'THSaraban'); //การตั้งค่ากระดาษถ้าต้องการแนวตั้ง ก็ A4 เฉยๆครับ ถ้าต้องการแนวนอนเท่ากับ A4-L
$pdf->SetAutoFont();
$pdf->SetDisplayMode('fullpage');
$pdf->WriteHTML($html, 2);
$pdf->Output();

?>